app/views/tracks/all.html.erb

        <td>
          <% album = Album.find_by(artist: track.artist, name: track.find_album) %>
---
SELECT  "albums".* FROM "albums" WHERE "albums"."artist_id" = 1 AND "albums"."name" = ? LIMIT ?  [["name", "SHINE"], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]