app/views/artists/all_albums.html.erb

SELECT  "albums".* FROM "albums" WHERE "albums"."artist_id" = 1 AND "albums"."name" = ? LIMIT ?  [["name", "Sounds From The Other Side"], ["LIMIT", 1]]
---
  <tbody>
    <% @artist.all_albums.each.with_index(1) do |album_name, index| %>