app/views/artists/related_artists.html.erb

  <tbody>
    <% @artist.related_artists.each.with_index(1) do |artist_name, index| %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT ?  [["name", "Reekado Banks"], ["LIMIT", 1]]