app/views/artists/show.html.erb

SELECT "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = ?  [["artist_id", 1]]
---
<div class="row">
  <% @artist.tracks.each do |track| %>

SELECT "albums".* FROM "albums" WHERE "albums"."artist_id" = ?  [["artist_id", 1]]
---
<div class="row">
  <% @artist.albums.each do |album| %>