app/views/artists/top_tracks.html.erb

  <tbody>
    <% @artist.top_tracks.each.with_index(1) do |track_name, index| %>
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = 1 AND "tracks"."name" = ? LIMIT ?  [["name", "My Love"], ["LIMIT", 1]]