app/views/users/show.html.erb


<% if @user.playlists.empty? %>
---
SELECT  1 AS one FROM "playlists" WHERE "playlists"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = ?  [["user_id", 1]]