app/views/albums/show.html.erb

  <tbody>
    <% @album.all_tracks.each.with_index(1) do |track_name, index| %>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = ?  [["album_id", 2]]

        <td>
          <% track = Track.find_by(artist: @artist, name: track_name) %>
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."artist_id" = 1 AND "tracks"."name" = ? LIMIT ?  [["name", "Sweet Love"], ["LIMIT", 1]]