app/controllers/albums_controller.rb

  def all
    @albums = Album.joins(:artist).order('artists.name')
---
SELECT "albums".* FROM "albums" INNER JOIN "artists" ON "artists"."id" = "albums"."artist_id" ORDER BY artists.name

  def create
    @album = @artist.albums.new(album_params)

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("name", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sounds From The Other Side"], ["artist_id", 1], ["created_at", "2018-04-27 16:55:25.104570"], ["updated_at", "2018-04-27 16:55:25.104570"]]

    def find_artist
      @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]