app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Wizkid"], ["created_at", "2018-04-27 08:41:26.974444"], ["updated_at", "2018-04-27 08:41:26.974444"]]