app/controllers/playlists_controller.rb

  def add_track
    @all_tracks = Track.joins(:artist).order('artists.name')
    if params[:track_id].present?
      found_track = Track.find(params[:track_id])
      @playlist.tracks << found_track unless @playlist.tracks.include?(found_track)
---
SELECT "tracks".* FROM "tracks" INNER JOIN "artists" ON "artists"."id" = "tracks"."artist_id" ORDER BY artists.name
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "tracks" WHERE "tracks"."name" = ? AND ("tracks"."id" != ?) AND "tracks"."artist_id" = ? LIMIT ?  [["name", "My Love"], ["id", 1], ["artist_id", 1], ["LIMIT", 1]]

  def create
    @playlist = current_user.playlists.new(playlist_params)

    if @playlist.save
---
INSERT INTO "playlists" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["name", "Test"], ["created_at", "2018-04-27 08:41:07.672164"], ["updated_at", "2018-04-27 08:41:07.672164"]]

    def set_playlist
      @playlist = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]