app/controllers/tracks_controller.rb

  def all
    @tracks = Track.joins(:artist).order('artists.name')
---
SELECT "tracks".* FROM "tracks" INNER JOIN "artists" ON "artists"."id" = "tracks"."artist_id" ORDER BY artists.name

  def create
    @track = @artist.tracks.new(track_params)

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("name", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "My Love"], ["artist_id", 1], ["created_at", "2018-04-27 08:41:33.788971"], ["updated_at", "2018-04-27 08:41:33.788971"]]

    def find_artist
      @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

     def find_album
      @album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def set_track
      @track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]