app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_hash" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_hash", "$2a$10$YT8mjDTzJZQdYjB8.HiuLu8YOgy6UmmrkPy24KfmlBcptUMIAqG3W"], ["updated_at", "2018-04-27 18:32:11.000710"], ["id", 2]]
---
  def update
    if @user == current_user && @user.update(user_params)