app/controllers/welcome_controller.rb

SELECT "playlists".* FROM "playlists" ORDER BY "playlists"."created_at" DESC
---
  def index
  	@playlist = Playlist.new
  	return unless logged_in?
  	@playlists = Playlist.order(created_at: :desc)