app/views/playlists/add_track.html.erb

        <td>
          <% in_track = @playlist.tracks.include? track %>
---
SELECT  1 AS one FROM "tracks" WHERE "tracks"."playlist_id" = ? AND "tracks"."id" = ? LIMIT ?  [["playlist_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "tracks".* FROM "tracks" INNER JOIN "artists" ON "artists"."id" = "tracks"."artist_id" ORDER BY artists.name