app/views/playlists/index.html.erb

        <td>
          <%= playlist.user.first_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]