app/views/playlists/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <strong>Playlist Name:   </strong><%=@playlist.name %><br>
      <strong>Playlist Creator:   </strong><%= @playlist.user.first_name %><br>

SELECT "tracks".* FROM "tracks" WHERE "tracks"."playlist_id" = ?  [["playlist_id", 1]]
---

<% if @playlist.tracks.blank? %>